#Создать строку равную первым пяти символам введенной строки.

stroka = str(input())
print(stroka[0:5])