#Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

length = float(input('Cube edge length = '))

volume = length**2*length
area = length**2

print('Volume = ', volume)
print('Area = ', area)