#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = float(input(('First number: ')))
b = float(input(('Second number: ')))

print('summ = ', a+b)
print('difference = ', a-b)
print('multiplication = ', a*b)