# Создать строку равную первым пяти символам введенной строки.

stroka = input()
print(stroka[0:5])
