"""Создать строку равную предпоследнему символу введенной строки."""

print("vvedite stroku")
a = input()
b = len(a) - 2
print(a[b])
