"""Создать строку равную введенной строку без последних двух символов."""

print("vvedite stroku")
a = input()
b = len(a) - 2
print(a[0:b])
