#Создать строку равную введенной строку без последних двух символов.

stroka = str(input())
print(stroka[0:-2])
