# Задание 7.05
# Создать функцию, принимающая на вход неопределенное
# количество аргументом и возвращающая сумму args[i] * i
# Пример: args = [4,3,2,1], 4 * 0 + 3 * 1 + 2 * 2 + 1 * 3 = 10

def sum_arg(*args: tuple):  # функция принимает неопределенное количество аргументов
    args = list(args)  # преобразование кортежа(tuple) в список(list)
    a = 0  # переменная для подсчета суммы
    for index, i in enumerate(
            args):  # цикл, присваивает переменным "index" - номер элемента в списке и "i" - сам элемент списка
        a += index * i  # находим сумму произведения элемента списка и его номера в списке
    return a  # возвращем полученную сумму


print(sum_arg(4, 3.5, 2, 5, 3, 2, 1))  # выводим на экран вызов функции с непределенным количеством аргументов
