'''Дан список. Создать новый список, сдвинутый на 1 элемент влево
Пример: 1 2 3 4 5 -> 2 3 4 5 1'''


a = [1, 2, 3, 4]
s = []
for item in a[1:]:
    s.append(item)
s.append(a[0])
print(s)
