"""Даны 2 действительных числа a и b. Получить их сумму, разность и
произведение."""

print("Введите два числа a и b")
a = int(input())
b = int(input())
print(f"Сумма равна {a + b}")
print(f"Разность равна {a - b}")
print(f"Произведение равно {a * b}")
