# Создать строку равную введенной строку без последних двух символов.

stroka = input()
print(stroka[0:-2])
