# Дан список целых чисел.
# Создать новый список, каждый элемент которого равен исходному элементу
# умноженному на -2

for i in range(0, 6):
    i *= -2
    print(i, end=(" "))
