#Создать строку равную предпоследнему символу введенной строки.

stroka = str(input())
print(stroka[-2])
