#Дан список. Создать новый список, сдвинутый на 1 элемент влево
#Пример: 1 2 3 4 5 -> 2 3 4 5 1

a = ["1", "2", "3", "4", "5"]

_len = len(a)
index = 0
for _i in a:
    if a[index] == a[0]:
        print(a[1:] + list(a[0]))
    index += 1


