"""Создать строку равную первым пяти символам введенной строки."""

print("vvedite stroku")
a = input()
print("pervie 5 simvolov stroki")
print(a[0:5])
