"""Дан список целых чисел.
Создать новый список, каждый элемент которого равен
исходному элементу умноженному на -2"""


a = [1, 5, 6, 9, 19, 22, 24, 56, 3, 21, 14, 15]
s = 0
for i in a:
    print(i * -2)

a = [1, 5, 6, 9, 19, 22, 24, 56, 3, 21, 14, 15]
while a:
    x = a.pop()
    s = x * -2
    print(s)
