"""Создать строку равную третьему символу введенной строки."""

print("Vvedite stroku")
b = input()
print("kakoi simvol vas interesuet")
a = int(input())
c = a - 1
print(b[c])
